jmeter/overload-test-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Product Service Overload Test">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_HOST" elementType="Argument">
            <stringProp name="Argument.name">BASE_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ── Thread Group: Ramp 50 → 200 QPS ─────────────────────────────── -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="Overload Ramp (50→200 QPS)">
        <!-- 200 concurrent threads, each sending 1 req/s ≈ 200 QPS -->
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">60</intProp>    <!-- 60s ramp -->
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>

        <!-- HTTP Defaults -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement"
                           testname="HTTP Defaults">
          <stringProp name="HTTPSampler.server">${BASE_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">5000</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- Header Manager -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- GET /api/v1/products/1 (50% weight) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET Product by ID">
          <stringProp name="HTTPSampler.path">/api/v1/products/1</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Throughput Controller: 50% of requests go here -->
          <ThroughputController guiclass="ThroughputControllerGui"
                                testclass="ThroughputController" testname="50% Weight">
            <intProp name="ThroughputController.style">1</intProp>
            <floatProp name="ThroughputController.percentThroughput">50.0</floatProp>
          </ThroughputController>
          <hashTree/>
          <!-- Constant Timer: 1 req/s per thread -->
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="1 RPS">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>

        <!-- GET /api/v1/products (30% weight) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET Products List">
          <stringProp name="HTTPSampler.path">/api/v1/products?page=0&amp;size=20</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ThroughputController guiclass="ThroughputControllerGui"
                                testclass="ThroughputController" testname="30% Weight">
            <intProp name="ThroughputController.style">1</intProp>
            <floatProp name="ThroughputController.percentThroughput">30.0</floatProp>
          </ThroughputController>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="1 RPS">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>

        <!-- POST /api/v1/products (20% weight) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST Create Product">
          <stringProp name="HTTPSampler.path">/api/v1/products</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{
  "name": "JMeter Product ${__threadNum}-${__counter(,)}",
  "description": "Created by JMeter overload test",
  "price": 99.99,
  "sku": "JM-${__threadNum}-${__time(,)}",
  "category": "LoadTest",
  "stockQuantity": 10
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ThroughputController guiclass="ThroughputControllerGui"
                                testclass="ThroughputController" testname="20% Weight">
            <intProp name="ThroughputController.style">1</intProp>
            <floatProp name="ThroughputController.percentThroughput">20.0</floatProp>
          </ThroughputController>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="1 RPS">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>

        <!-- Response Assertion: Accept 200, 201, 429 (rate limited = expected) -->
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                           testname="Accept 200/201/429">
          <collectionProp name="Asserion.test_strings">
            <stringProp>200</stringProp>
            <stringProp>201</stringProp>
            <stringProp>429</stringProp>
          </collectionProp>
          <intProp name="Assertion.test_type">40</intProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
        </ResponseAssertion>
        <hashTree/>

        <!-- Aggregate Report listener -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                         testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">jmeter/results/overload-results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>